app/views/static_pages/index.html.erb

<script>
 var feedsJSON = '<%= Feed.all.to_json(only: [:id, :title]).html_safe %>'
---
SELECT "feeds".* FROM "feeds"