app/controllers/api/feeds_controller.rb

  def index
    render :json => Feed.all
---
SELECT "feeds".* FROM "feeds"

  def show
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 20 Nov 2014 21:46:13 UTC +00:00], ["title", "Gizmodo"], ["updated_at", Thu, 20 Nov 2014 21:46:13 UTC +00:00], ["url", "http://feeds.gawker.com/gizmodo/full"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://feeds.gawker.com/gizmodo/full' LIMIT 1

  def destroy
    feed = Feed.find(params[:id])
    feed.delete
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "7"]]
DELETE FROM "feeds" WHERE "feeds"."id" = 7